# extentions 탭에서 python 검색 후 상위에서 3개 설치한다
# 에러 발생 시(경로에러) :  아나콘다 홈에서 vscode install 시킴 -> launch 클릭
#                       -> 소스코드 창에서 오른쪽 마우스 클릭-> 런 파이썬 파일 인 터미널 클릭


# 단일데이터(단일 타입)
# > 수치형: 정수, 부동소수, 진법, ...
# 파이썬은 모든것이 객체이다
# 10은 수치값이 아닌 객체이다 => 주소값이 변수에 세팅된거라서
# 대상이 바뀌어도 괜찮다
# 1.찍으면 객체이기 때문에 변수들이 나온다
# 사전에 정의된 키워드, 내장함수 등등 그런 이름을 변수로 쓰면 안된다.
# 오류도 발생안하고, 의미가 변경된다.

a = 10 # ;세미콜론은 써도 되고 안써도 됨(쓸경우: 한줄에 여러개 표현시)
print(a)
a = 1.1
print(a)

# 타입 확인하는 내장함수 (마치 원래 있었던 것처럼 함수를 사용)
print(type(a)) # 결과값 : class 'float'

# 변수명은 타언어 사용한것과 동일하게 적용
userAge = 10
user_age = 10
_userAge = 10 

# __name__를 직접 구동한 코드에서는 "__main__"으로 나오고
# 외부에서 p1.py를 모듈로 가져와서 구동하면 "p1(파일명)"으로 나온다
# 모듈화에서 테스트코드, 엔트리 포인트 사용시 자주 사용된다
print( __name__, type( __name__ )) # 내장변수, 결과값: __main__<class  'str'>

# 기본연산은 타언어와 동일
# 2의 3제곱 
print( 2**3 )
# 6을 5로 나누고, 소수점 아래는 버린다
print( 6 / 5 )
print( 6 // 5 )
# 연산자 우선순위를 모르겠다 => ()를 써서 우선순위를 두면된다
# 파이썬에서는 튜플과 구분이 필요하다















